[{"name": "Alexandra Kaloyanides", "department": "Religious Studies", "academic_interests": ["", "", "", "American Baptists", "american religious history", "buddhism", "Burma", "", "", "Burmese religions", "religious contestations", "religious conversions", "religious transformation", "", "", ""], "college": "Religious Studies", "bio": "Alexandra Kaloyanides is an Assistant Professor in the Religious Studies department at the University of North Carolina, Charlotte where her teaching focuses on Buddhism. She researches Burmese religions and American religious history. Her book manuscript, Objects of Conversion, Relics of Resistance,” examines the religious contestations, conversions, and transformations during the nineteenth-century American Baptist mission to Burma. ", "link": "https://pages.charlotte.edu/connections/people/akaloyan/"}, {"name": "Aaron Kashtan", "department": "Writing, Rhetoric, and Digital Studies", "academic_interests": ["", "", "", "", "", "", "", ""], "college": "Writing, Rhetoric, and Digital Studies", "bio": "  LECTURER | FIRST-YEAR WRITING     Department Profile Page     ", "link": "https://pages.charlotte.edu/connections/people/akashtan/"}, {"name": "Anna Kenar", "department": "Art & Art History", "academic_interests": ["", "", "", "art", "art history", "", "", "visual arts", "", "", ""], "college": "Art & Art History", "bio": "       Anna Kenar is a lecturer in foundations for the Department of Art & Art History.    View her faculty profile at coaa.uncc.edu >> ", "link": "https://pages.charlotte.edu/connections/people/akenar/"}, {"name": "Akinwumi Ogundiran", "department": "Africana Studies", "academic_interests": ["", "", "", "African modernities", "archaelogy", "cultural history", "", "", "diaspora", "material culture", "transatlantic studies", "", "", ""], "college": "Africana Studies", "bio": " Education:  Ph.D., Boston University, 2000 M.Sc., University of Ibadan, 1991 B.A. (First Class Honors), Obafemi Awolowo University, Ile-Ife, 1988  Appointment: Dr. Akin Ogundiran is Chancellor’s Professor, and Professor of Africana Studies, Anthropology & History at the University of North Carolina, Charlotte where he also served as chair of the Africana Studies Department from 2008 to 2018. He previously taught in the Department of History at Florida International University, Miami and served as director of the institution’s African-New World Studies, 2006-2008. His teaching career began in Nigeria where he taught at the University of Benin, among others. Research and Scholarship: Dr. Ogundiran is a transdisciplinary scholar whose research interests focus broadly on the emergent communities, social complexity, and cultural history in the Yoruba world over the past one thousand years, using archaeological, historical, ethnographic, and material science methods. His earlier research efforts sought to understand the impacts of global/regional social, political, and economic processes on community formations; and how social actors created knowledge, communities, and identities with objects and the landscape, 1000-1800 AD. Ogundiran is currently leading a research project on the political economy and settlement ecology of the Oyo Empire, focusing on the landscape history of the empire’s metropolitan area (Oyo-Ile) and one of its colonies (Ede-Ile). He has also facilitated collaborative projects on the archaeology of Atlantic Africa and the African Diaspora. In addition, he has written on historiography, Black Intellectual Thoughts, social sustainability, and cultural heritage issues. Dr. Ogundiran has received support for his research from the National Geographic Society, Archaeological Institute of America, National Humanities Center, Carnegie Foundation, Dumbarton Oaks, Social Science Research Council, Wenner-Gren Foundation for Anthropological Research, National Endowment for the Humanities, Boston Humanities Foundation, American Philosophical Society, and the National Science Foundation-supported programs, among others. In spring 2018, he was a Yip Fellow in Magdalene College, University of Cambridge. Ogundiran has convened major conferences and symposia including the Haitian Constitutional Reform (2007), African Culture and Development (2007), Orisa Music and Dance: Discourses of Modernity and Transnationalism (2008), Materialities and Meanings of Rituals in Atlantic Africa and the African Diaspora (Society of Historical Archaeology Annual Conference, January 2009, Toronto), Presidency of Barack Obama (2010), the New African Diaspora in the US (2011), and Moral Economies (2014). He also curated two exhibitions – one on stamps, and the other on hisarchaeological research in the Osun-Osogbo Sacred Grove, Nigeria. He has been profiled and his publications anthologized in publications, including Encyclopedia of Global Archaeology. He currently serves as Editor-in-Chief of African Archaeological Review, and he is on the editorial board of several journals and book series. Publication: Dr. Ogundiran has authored, edited, and co-edited several publications, including Archaeology and History in Ilare District, 1200-1900(Cambridge Monograph in African Archaeology 55, 2002);Precolonial Nigeria(Africa World Press, 2005);Archaeology of Atlantic Africa and the African Diaspora (Indiana University Press, 2007); Power and Landscape in AtlanticWest Africa(Cambridge University Press, 2012); and Materialities of Ritual in the Black Atlantic(Indiana University Press, 2014), which won a Choice Outstanding Academic Title for 2015. His latest book is The Yoruba: A New History (2020). Recognition: Dr. Ogundiran has been recognized for his research, service, and teaching. He is the recipient of the 2006 University of Texas Africanist Award for Research Excellence. In 2007, he was awarded a Certificate of Special United States Congressional Recognition for Excellence in Service. He was presented with the TOFAC Research, Leadership, and Service Award at the University of North Carolina-Wilmington in 2013. In 2018, Nigeria’s Centre for Black Culture and International Understanding, a Category II affiliate of UNESCO, presented him with its Award of Excellence. He is a member of the Mu Chapter of Phi Beta Delta (Honor Society for International Scholars) and The Honor Society of Phi Kappa Phi, the nation’s oldest and most selective all-discipline collegiate honor society. He is recipient of UNC Charlotte’s highest honor for research excellence, the First Citizen’s Bank Scholars Medal (2021). Recent Courses Taught:  Great Archaeological Discoveries in Africa African Civilizations African Diaspora and Transnational Theory Capitalism, Africa, and the African Diaspora African Diaspora Cultures Senior Seminar: Africana Modernities Yoruba Language and Culture  Selected Keynotes and Public Lectures:  City of Newton (NC) 2009 Unity Day Guest Speaker Ubuntu: An African Philosophical Reflection on One Community, One Humanity” From Politics of Resistance to Pedagogy of Renewal: The Legacies of the African Diasporas in the Making of American Democracies.” Keynote Address, CAPES/FIPSE Brazil-US Symposium on Legacies of African Diaspora in Brazil and the United States. Universidade Federal de Minas Gerais, Belo Horizonte, Brazil. May 26th to 28th, 2011. Crises of Culture and Consciousness in the Postcolony: What is the Future for Nigeria?,” Keynote Address, CULTURE AND SOCIETY IN POST-COLONIAL NIGERIA: CONFERENCE IN HONOR OF ULLI BEIER. November 28 – 30, 2011, University of Ibadan, Ibadan. Collapsing Boundaries: A Continental Vision for African Archaeology.” Keynote Address, Joint 14th Congress of the Pan-African Archaeological Association of Prehistory and Related Studies and 22nd Biennial Meeting of the Society of Africanist Archaeologists. University of the Witwatersrand, Johannesburg, South Africa. July 14-18, 2014. The Archaeology of Aláàfin’s Legacy and Heritage.” Keynote address delivered at the International Conference on the Alaafin of Oyo Institution, organized by The Centre for Black Culture and International Understanding, Osogbo, and held at Ajayi Crowther University, Oyo. October 8-11, 2018. Archaeology of Atlantic Modernity: Global Experience, Local Meaning,” The 28th Annual Distinguished Lecture in African Archaeology, University of Florida, Gainesville. January 17, 2020.  Other Resources:  Wikipedia Page Twitter Facebook Page  ", "link": "https://pages.charlotte.edu/connections/people/akinwumi-ogundiran/"}, {"name": "Amber Knight", "department": "Political Science and Public Administration", "academic_interests": ["", "", "", "democratic theory", "disability theory", "", "", "feminist political thought", "", "", ""], "college": "Political Science and Public Administration", "bio": "       ASSISTANT PROFESSOR              Amber Knight, Assistant Professor of Political Science and Public Administration, earned her B.A. from the University of California, Santa Cruz and her Ph.D. from the University of North Carolina, Chapel Hill. Her research generally focuses on contemporary democratic theory, disability theory, and feminist political thought. She has published articles inThe Journal of Politics,Hypatia, andPolitics, Groups, and Identities, among other outlets. She is currently working on a book project, tentatively titledDisability, Autonomy, and the Politics of Parenthood. The book examines the experiences of parents of children with disabilities in order to reconsider the meaning of autonomy and better understand the relationship between politics as usual” and the family. Chapters cover a range of relevant issues surrounding the experiences of parents of children with disabilities, including: reproductive autonomy and the selective abortion of disabled fetuses; guardianship laws; the ethic of care; and, special education policy.  Dr. Knight’s CV   Department Profile Page  ", "link": "https://pages.charlotte.edu/connections/people/aknigh23/"}]